src/main/resources/soapxml/SoftwareImageUpdate.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <Credentials xmlns="http://Airspan.Netspan.WebServices">
            <Username>wsadmin</Username>
            <Password>password</Password>
        </Credentials>
    </soap:Header>
    <soap:Body>
        <SoftwareImageUpdate xmlns="http://Airspan.Netspan.WebServices">
            <Name>SWIT17-Harmony42</Name>
            <SoftwareImage>
                <HardwareCategory>AirHarmony</HardwareCategory>
                <SoftwareFileInfo>
                    <ImageType>LTE</ImageType>
                    <FileNameWithPath>/upload/enodeb.14_17_00_501.enc</FileNameWithPath>
                    <Version>14.17.00.501</Version>
                </SoftwareFileInfo>
            </SoftwareImage>
        </SoftwareImageUpdate>
    </soap:Body>
</soap:Envelope>